# 1. Напишите программу, которая запрашивает два целых числа и выводит их сумму
# 2. Напишите программу, которая принимает строку и преобразует ее в целое число
# 3. Напишите программу, которая запрашивает два целых числа и выводит их разность
# 4. Напишите программу, которая запрашивает два дробных числа и выводит их произведение
#  и результат их деления
# 5. Напишите программу, которая принимает число и преобразует его в строку
# 6. Напишите программу, которая принимает две строки и складывает их через пробел
# 7. Напишите программу, которая принимает строку и число и выводит результат их сложение (число)