# 1. Напишите программу, которая запрашивает два целых числа и выводит их сумму
# 2. Напишите программу, которая принимает строку и преобразует ее в целое число
# line = int(input('Введите строку: '))
# print(type(line))
# 3. Напишите программу, которая запрашивает два целых числа и выводит их разность
# a = int(input())
# b = int(input())
# result = a - b
# print(result)
# 4. Напишите программу, которая запрашивает два дробных числа и выводит их произведение
#  и результат их деления
# a = float(input())
# b = float(input())
# res1 = a * b
# res2 = a / b
# print(res1, res2)
# 5. Напишите программу, которая принимает число и преобразует его в строку
# arg = 505
# arg = str(arg)
# 6. Напишите программу, которая принимает две строки и складывает их через пробел
# line1 = input()
# line2 = input()
# print(line1 + ' ' + line2)

# 7. Напишите программу, которая принимает строку и число и выводит результат их сложение (число)

string = int(input())
digit = 505
result = string + digit
print(result)
