# 1. Напишите программу, которая на вход принимает
# два числа и сравнивает какое из них больше

# 2. Напишите программу, которая на вход принимает число и
#  выводит четное оно или не четное 

# 3. Напишите программу, которая на вход принимает число и определяет
# положительное оно, отрицательное или ноль

# 4. Напишите программу которая работает как калькулятор
# if ...:
#     pass
# elif ...:
#     pass
# elif ...:
#     if ...:
#         pass
#     else:
#         pass
# elif ...:
#    pass
# else:
#     pass 


# 5. Напишите программу, которая на вход принимает год и определяет 
# високосный он или нет.
# Високосный год тот, что делится на 4, но не делится на 100, за исключением
# деления на 400.

# 6. Запросите у пользователя время в часах от 0 до 23 и выведите:
#  - Утро с 6 до 11
#  - День с 12 до 17
#  - Вечер с 18 до 23
#  - Ночь с 0 до 5

# 7. Напишите программу которая проверяет, совпадает ли введенный 
# пользователем пароль с заданным (напр. secret12345). Если совпадает, 
# то "Доступ разрешен", в противном случае "Доступ запрещен". 

# 8. Напишите программу, которая:
# Спрашивает у юзера число
# Если делится на 3, то выводит Fizz
# Если делится на 5, то Buzz
# Если делится на 3 и на 5 FizzBuzz
# Иначе просто выводит число