# 1. ... вычисляет сумму всех чисел от 1 до 100 включительно используя for. 
# результат вывести на экран
# summa = 0
# for i in range(1, 101):
#     summa += i
# print(summa)
# 2. запрашивает у пользователя строку и выводит каждый символ в новой строке (for)
# line = input()
# for i in line:
#     print(i)
# 3. запрашивает число у юзера и выводит таблицу умножения этого числа от 1 до 15
# 4. запрашивает у пользователя число n и вычисляет сумму всех четных чисел
# от 1 до n включительно. Используйте цикл for и условие.
# 5. запрашивает у пользователя число n и находит сумму всех чисел от 1 до n, которые делятся
# на 3 без остатка. Используйте цикл while.
n = int(input("Введите число "))
summa = 0
i = 1
while i <= n: 
    if i % 3 == 0:
        summa += i
    i += 1
print (summa)

# 6. Напишите программу, которая запрашивает у пользователя число и проверяет,
#  является ли оно простым. Число называется простым, если оно делится только 
# на 1 и на само себя. Используйте цикл for для проверки делимости.
# 7. Напишите программу, которая запрашивает у пользователя строку и проверяет, 
# является ли она палиндромом (читается одинаково слева направо и справа налево).
# Пробелы и регистр букв не учитываются.

#####################ДЗ#########################
# 1. Напиши программу, которая считает сумму чисел от 1 до 100.
#    На каждом шаге выводи текст "Эх, опять прибавляю X", где X — текущее число.
#    В конце выведи результат: "Ладно, вот тебе сумма: ..."

# 2. Запроси у пользователя строку.
#    Напечатай каждый символ строки на новой строке с комментарием "тык-тык...".

# 3. Запроси у пользователя число и выведи таблицу умножения на него от 1 до 10.
#    Если результат делится на 5 — напечатай "Фу, 5 опять..." после строки.

# 4. Запроси у пользователя число n.
#    Найди и выведи все чётные числа от 1 до n.
#    Также выведи, сколько всего чётных чисел было найдено.

# 5. Запроси у пользователя число n.
#    Выведи все числа от 1 до n, пропуская те, которые делятся на 3.
#    Для этого используй continue.

# 6. Реализуй программу, которая бесконечно запрашивает числа у пользователя,
#    пока он не введёт 0. После этого выведи сумму всех введённых чисел (кроме нуля).

# 7. Запроси у пользователя одно число.
#    Выведи "О, ты выбрал чётное число!" если число чётное, иначе "Ха, нечётное! А ты весёлый."

# 8. Запроси у пользователя строку.
#    Посчитай, сколько в строке букв "а" и выведи это количество.

# 9. Запроси у пользователя число.
#    Если оно делится на 7 без остатка — выведи "Семёрка... ты наш человек!",
#    иначе — выведи "Хм, подозрительно...".
